test-scripts/request-flight.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:gs="flightsSchema.xsd">
	<soapenv:Header/>
	<soapenv:Body>
		<gs:getFlightRequest>
			<gs:flightId>test2</gs:flightId>
			<gs:flightDate>date-test</gs:flightDate>
		</gs:getFlightRequest>
	</soapenv:Body>
</soapenv:Envelope>